app/Services/DesignConfigService.php

select * from `design_configs` limit 1
---
    public function getColors(): array
    {
        $config = DesignConfig::first();