app/Models/Tenant/Integration.php

select exists(select * from `integrations` where `provider` = 'google' and `is_active` = 1 and `client_id` is not null and `client_id` != '' and `client_secret` is not null and `client_secret` != '') as `exists`
---
    public static function isProviderConfigured(string $provider): bool
    {
        return static::where('provider', $provider)
            ->where('is_active', true)
            ->whereNotNull('client_id')
            ->where('client_id', '!=', '')
            ->whereNotNull('client_secret')
            ->where('client_secret', '!=', '')
            ->exists();